    # -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""


x=input('Введите ip и маску:')
x=x.split('.')
ip1=x[0]
ip2=x[1]
ip3=x[2]


mask=x[3]
mask=mask.split('/')
ip4=mask[0]
mask1=mask[1]

ip_template = '''
     Network:
     {:<8} {:<8} {:<8} {:<8}
     {:08b} {:08b} {:08b} {:08b}
     '''
print(ip_template.format(ip1, ip2, ip3, ip4, int(ip1), int(ip2), int(ip3), int(ip4)))
# print('\n',ip1,'\t',ip2,'\t',ip3,'\t',ip4,'\n',bin(int(ip1))[2:],'\t',bin(int(ip2))[2:],'\t',bin(int(ip3))[2:],'\t',bin(int(ip4))[2:])


ms='1'*int(mask1)+'0'*(32-int(mask1))

ms1=ms[:8]
m1=int(ms1,2)

ms2=ms[8:16]
m2=int(ms2,2)

ms3=ms[16:24]
m3=int(ms3,2)

ms4=ms[24:]
m4=int(ms4,2)
# print('\n',"/",mask1)

mask_template = '''
     Mask:
     /{}
     {:<8} {:<8} {:<8} {:<8}
     {:08b} {:08b} {:08b} {:08b}
     '''
print(mask_template.format(mask1,m1, m2, m3, m4, int(m1), int(m2), int(m3), int(m4)))

# print('\n',m1,'\t\t',m2,'\t\t',m3,'\t\t',m4,'\n',ms1,'\t',ms2,'\t',ms3,'\t',ms4)    